function x=gs(~)
%该脚本程序功能为用G-S迭代方法对题设线性方程组求解
%预定迭代次数上限10000，如果超过上限则停止迭代，并说明迭代方式发散
%初始向量为[0;0;0;0]
%由于迭代结束条件为当前迭代解矩阵减去上一轮迭代解矩阵所得的矩阵的无穷范数小于1e-08
%所以在G-S迭代只用一组x矩阵保存迭代结果的前提下，定义了另一组解矩阵用于存放上一次
%迭代的结果，在每轮迭代完之后统一改变改解矩阵的值
A=[1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0;

    -1 3 -1 -1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0;

    -1 -1 4 -1 -1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0;

    -1 -1 -1 4 0 -1 0 0 0 0 0 0 0 0 0 0 0 0 0 0;

    0 0 -1 0 4 -1 -1 -1 0 0 0 0 0 0 0 0 0 0 0 0;

    0 0 0 -1 -1 4 -1 -1 0 0 0 0 0 0 0 0 0 0 0 0;

    0 0 0 0 -1 -1 4 -1 -1 0 0 0 0 0 0 0 0 0 0 0;

    0 0 0 0 -1 -1 -1 4 0 -1 0 0 0 0 0 0 0 0 0 0;

    0 0 0 0 0 0 -1 0 4 -1 -1 -1 0 0 0 0 0 0 0 0;

    0 0 0 0 0 0 0 -1 -1 4 -1 -1 0 0 0 0 0 0 0 0;

    0 0 0 0 0 0 0 0 -1 -1 4 -1 -1 0 0 0 0 0 0 0;

    0 0 0 0 0 0 0 0 -1 -1 -1 4 0 -1 0 0 0 0 0 0;

    0 0 0 0 0 0 0 0 0 0 -1 0 4 -1 -1 -1 0 0 0 0;

    0 0 0 0 0 0 0 0 0 0 0 -1 -1 4 -1 -1 0 0 0 0;

    0 0 0 0 0 0 0 0 0 0 0 0 -1 -1 4 -1 -1 0 0 0;

    0 0 0 0 0 0 0 0 0 0 0 0 -1 -1 -1 4 0 -1 0 0;

    0 0 0 0 0 0 0 0 0 0 0 0 0 0 -1 0 4 -1 -1 -1;

    0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -1 -1 4 -1 -1;

    0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -1 -1 4 -2;

    0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -1 -1 -2 4 ];
n=length(A);
B=[0;1;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0];        %输入矩阵B
e_s=1e-08;           %初始化迭代终止的容差
x=zeros(n,1);        %初始化迭代解
x_last=zeros(n,1);   %初始化存放上一次迭代结果的矩阵
for k=1:10000          %预定迭代次数上限为10000次
    for i=1:n        %进行一轮G-S迭代
        sum=0;
          for j=1:i-1
              sum=sum+A(i,j)*x(j);
          end
          if i~=n
          for j=i+1:n
              sum=sum+A(i,j)*x(j);
          end
          end
          x(i)=(B(i)-sum)/A(i,i);
          
    end
        if norm(x-x_last,inf)<e_s   %判断迭代是否终止
           k,x 
           break;
        end
        for i=1:n                   %更新上一轮迭代解矩阵
        x_last(i)=x(i);
        end  
end
    if k==10000                       %判断是否发散
        disp('迭代发散！'); end
        
        
       
            
        